src/cf/Catalogs/ТестовыйСправочник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ТестовыйСправочник</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТестовыйРеквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ТестовыйСправочник/Ext/ManagerModule.bsl
// =============================================================================
// Модуль менеджера справочника ТестовыйСправочник
// Набор экспортных функций/процедур для тестирования внешних вызовов
// из редактора кода (oneDebugger)
// =============================================================================

#Область ПрограммныйИнтерфейс

// Создает новый элемент справочника с указанными параметрами.
//
// Параметры:
//  Наименование   - Строка - наименование элемента
//  ТестовыйРеквизит - Строка - значение тестового реквизита (необязательно)
//  Код            - Строка - код элемента (необязательно, если не задан — автонумерация)
//  Состав         - Массив из Структура - строки табличной части "Состав" (необязательно)
//                    Каждая структура: Наименование (Строка), Количество (Число), Цена (Число)
//
// Возвращаемое значение:
//  СправочникСсылка.ТестовыйСправочник - ссылка на созданный элемент
//
Функция СоздатьТестовыйЭлемент(Наименование, ТестовыйРеквизит = "", Код = Неопределено, Состав = Неопределено) Экспорт
    НовыйОбъект = Справочники.ТестовыйСправочник.СоздатьЭлемент();
    НовыйОбъект.Наименование    = Наименование;
    НовыйОбъект.ТестовыйРеквизит = ТестовыйРеквизит;
    Если Код <> Неопределено Тогда
        НовыйОбъект.Код = Код;
    КонецЕсли;
    Если Состав <> Неопределено Тогда
        Для Каждого СтрокаСостава Из Состав Цикл
            НоваяСтрока = НовыйОбъект.Состав.Добавить();
            НоваяСтрока.Наименование = СтрокаСостава.Наименование;
            НоваяСтрока.Количество   = СтрокаСостава.Количество;
            НоваяСтрока.Цена         = СтрокаСостава.Цена;
        КонецЦикла;
    КонецЕсли;
    НовыйОбъект.Записать();
    Возврат НовыйОбъект.Ссылка;
КонецФункции

// Получает объект элемента справочника по ссылке.
//
// Параметры:
//  Ссылка - СправочникСсылка.ТестовыйСправочник - ссылка на элемент
//
// Возвращаемое значение:
//  СправочникОбъект.ТестовыйСправочник - объект элемента
//  или Неопределено, если ссылка пустая
//
Функция ПолучитьОбъектЭлемента(Ссылка) Экспорт
    Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
        Возврат Неопределено;
    КонецЕсли;
    Возврат Ссылка.ПолучитьОбъект();
КонецФункции

// Изменяет тестовый реквизит элемента справочника.
//
// Параметры:
//  Ссылка            - СправочникСсылка.ТестовыйСправочник - ссылка на элемент
//  НовоеЗначение     - Строка - новое значение тестового реквизита
//
// Возвращаемое значение:
//  Булево - Истина, если запись выполнена успешно
//
Функция ИзменитьТестовыйРеквизит(Ссылка, НовоеЗначение) Экспорт
    Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
        Возврат Ложь;
    КонецЕсли;

    Объект = Ссылка.ПолучитьОбъект();
    Объект.ТестовыйРеквизит = НовоеЗначение;
    Попытка
        Объект.Записать();
        Возврат Истина;
    Исключение
        Возврат Ложь;
    КонецПопытки;
КонецФункции

// Возвращает количество элементов в справочнике.
//
// Возвращаемое значение:
//  Число - количество элементов
//
Функция ПолучитьКоличествоЭлементов() Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |   КОЛИЧЕСТВО(*) КАК Кол
        |ИЗ
        |   Справочник.ТестовыйСправочник КАК Т
        |ГДЕ
        |   НЕ Т.ПометкаУдаления";
    Выборка = Запрос.Выполнить().Выбрать();
    Выборка.Следующий();
    Возврат Выборка.Кол;
КонецФункции

// Возвращает все элементы справочника в виде массива структур.
//
// Возвращаемое значение:
//  Массив из Структура - массив с ключами: Ссылка, Код, Наименование, ТестовыйРеквизит
//
Функция ПолучитьВсеЭлементы() Экспорт
    Результат = Новый Массив;

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |   Т.Ссылка      КАК Ссылка,
        |   Т.Код          КАК Код,
        |   Т.Наименование КАК Наименование,
        |   Т.ТестовыйРеквизит КАК ТестовыйРеквизит
        |ИЗ
        |   Справочник.ТестовыйСправочник КАК Т
        |ГДЕ
        |   НЕ Т.ПометкаУдаления
        |УПОРЯДОЧИТЬ ПО
        |   Т.Код";

    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Строка = Новый Структура;
        Строка.Вставить("Ссылка",           Выборка.Ссылка);
        Строка.Вставить("Код",              Выборка.Код);
        Строка.Вставить("Наименование",     Выборка.Наименование);
        Строка.Вставить("ТестовыйРеквизит", Выборка.ТестовыйРеквизит);
        Результат.Добавить(Строка);
    КонецЦикла;

    Возврат Результат;
КонецФункции

// Удаляет элемент справочника (помечает на удаление).
//
// Параметры:
//  Ссылка - СправочникСсылка.ТестовыйСправочник - ссылка на удаляемый элемент
//
// Возвращаемое значение:
//  Булево - Истина, если пометка удаления установлена
//
Функция ПометитьНаУдаление(Ссылка) Экспорт
    Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
        Возврат Ложь;
    КонецЕсли;

    Объект = Ссылка.ПолучитьОбъект();
    Объект.УстановитьПометкуУдаления(Истина);
    Возврат Истина;
КонецФункции

// Выполняет пакетное создание элементов справочника.
//
// Параметры:
//  Количество - Число - количество создаваемых элементов
//  Префикс    - Строка - префикс наименования (по умолчанию "Тест_")
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.ТестовыйСправочник - массив ссылок
//
Функция СоздатьНабор(Количество, Префикс = "Тест_") Экспорт
    Результат = Новый Массив;
    Для Инд = 1 По Количество Цикл
        Наименование = Префикс + Формат(Инд, "ЧЦ=3; ЧВН=");
        Ссылка = СоздатьТестовыйЭлемент(Наименование, "Р" + Формат(Инд, "ЧЦ=3; ЧВН="));
        Результат.Добавить(Ссылка);
    КонецЦикла;
    Возврат Результат;
КонецФункции

// Вычисляет суммарную длину наименований всех элементов справочника.
// Простая вычислительная функция для проверки вызова.
//
// Возвращаемое значение:
//  Число - суммарная длина наименований
//
Функция СуммарнаяДлинаНаименований() Экспорт
    Итого = 0;
    Выборка = Справочники.ТестовыйСправочник.Выбрать();
    Пока Выборка.Следующий() Цикл
        Итого = Итого + СтрДлина(Выборка.Наименование);
    КонецЦикла;
    Возврат Итого;
КонецФункции

// Формирует текстовый отчет по справочнику.
//
// Возвращаемое значение:
//  Строка - текстовый отчет
//
Функция СформироватьОтчет() Экспорт
    Отчет = "===== Отчет по справочнику ТестовыйСправочник =====" + Символы.ПС;
    
    Элементы = ПолучитьВсеЭлементы();
    Отчет = Отчет + "Количество элементов: " + Элементы.Количество() + Символы.ПС;
    Отчет = Отчет + Символы.ПС;

    Для Каждого Эл Из Элементы Цикл
        Отчет = Отчет
            + "  [" + Эл.Код + "] " + Эл.Наименование
            + " (реквизит=" + Эл.ТестовыйРеквизит + ")" + Символы.ПС;
    КонецЦикла;

    Отчет = Отчет + "===== Конец отчета =====" + Символы.ПС;
    Возврат Отчет;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Очищает все элементы справочника (непосредственное удаление).
// ВНИМАНИЕ: Используется только для тестирования!
//
Процедура ОчиститьСправочник() Экспорт
    Выборка = Справочники.ТестовыйСправочник.Выбрать();
    Пока Выборка.Следующий() Цикл
        Объект = Выборка.ПолучитьОбъект();
        Объект.Удалить();
    КонецЦикла;
КонецПроцедуры

#КонецОбласти
